SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/N9606Q9S4M/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESF!ICESMSLB\/RES.LB!1541763241445!44882713!131073</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-03-16T14:30" ArrivalDateTime="2019-03-17T11:35" FlightNumber="242" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="DXB"/>      <Equipment AirEquipType="388"/>      <MarketingAirline Code="EK" FlightNumber="242"/>      <OperatingAirline Code="EK"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-17T15:10" ArrivalDateTime="2019-03-17T19:55" FlightNumber="514" NumberInParty="1" ResBookDesigCode="T" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="EK" FlightNumber="514"/>      <OperatingAirline Code="EK"/>      <OriginLocation   LocationCode="DXB"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-26T11:00" ArrivalDateTime="2019-04-26T13:00" FlightNumber="511" NumberInParty="1" ResBookDesigCode="L" Status="NN">      <DestinationLocation   LocationCode="DXB"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="EK" FlightNumber="511"/>      <OperatingAirline Code="EK"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-26T15:10" ArrivalDateTime="2019-04-26T20:15" FlightNumber="528" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="HYD"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="EK" FlightNumber="528"/>      <OperatingAirline Code="EK"/>      <OriginLocation   LocationCode="DXB"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>